{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"outputs": {"y_prediction/op_to_store": {"name": "y_prediction/op_to_store"}}}, "modelTopology": {"node": [{"name": "dropout_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "data/Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3150"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "wc1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "wc2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "wc3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_2/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "wd1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7680"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "data/Placeholder_2", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "name", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Reshape", "input": ["data/Placeholder", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["sub/x", "data/Placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["sub_1/x", "data/Placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["sub_2/x", "data/Placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_3", "op": "Sub", "input": ["sub_3/x", "data/Placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "_FusedConv2D", "input": ["Reshape", "wc1", "Variable"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "dropout/Sub", "op": "Sub", "input": ["dropout/Const", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Sub", "op": "Sub", "input": ["dropout_1/Const", "sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/Sub", "op": "Sub", "input": ["dropout_2/Const", "sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Sub", "op": "Sub", "input": ["dropout_3/Const", "sub_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout/RealDiv", "op": "RealDiv", "input": ["MaxPool2d", "dropout/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "dropout/GreaterEqual", "op": "GreaterEqual", "input": ["dropout/random_uniform/RandomUniform", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Cast", "op": "Cast", "input": ["dropout/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout/Mul", "op": "Mul", "input": ["dropout/RealDiv", "dropout/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "_FusedConv2D", "input": ["dropout/Mul", "wc2", "Variable_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "MaxPool2d_1", "op": "MaxPool", "input": ["Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "dropout_1/Shape", "op": "Shape", "input": ["MaxPool2d_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_1/RealDiv", "op": "RealDiv", "input": ["MaxPool2d_1", "dropout_1/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_1/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "dropout_1/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_1/random_uniform/RandomUniform", "sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Cast", "op": "Cast", "input": ["dropout_1/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Mul", "op": "Mul", "input": ["dropout_1/RealDiv", "dropout_1/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_2", "op": "_FusedConv2D", "input": ["dropout_1/Mul", "wc3", "Variable_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "MaxPool2d_2", "op": "MaxPool", "input": ["Relu_2"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "dropout_2/Shape", "op": "Shape", "input": ["MaxPool2d_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_2/RealDiv", "op": "RealDiv", "input": ["MaxPool2d_2", "dropout_2/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_2/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "dropout_2/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_2/random_uniform/RandomUniform", "sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/Cast", "op": "Cast", "input": ["dropout_2/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/Mul", "op": "Mul", "input": ["dropout_2/RealDiv", "dropout_2/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1", "op": "Reshape", "input": ["dropout_2/Mul", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape_1", "wd1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Add", "op": "Add", "input": ["MatMul", "Variable_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Shape", "op": "Shape", "input": ["Relu_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_3/RealDiv", "op": "RealDiv", "input": ["Relu_3", "dropout_3/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_3/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "dropout_3/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_3/random_uniform/RandomUniform", "sub_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Cast", "op": "Cast", "input": ["dropout_3/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Mul", "op": "Mul", "input": ["dropout_3/RealDiv", "dropout_3/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "y_prediction/MatMul", "op": "MatMul", "input": ["dropout_3/Mul", "name"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "y_prediction/op_to_store", "op": "Add", "input": ["y_prediction/MatMul", "Variable_4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "dropout_3/Const", "shape": [], "dtype": "float32"}, {"name": "dropout_2/Const", "shape": [], "dtype": "float32"}, {"name": "dropout_1/Const", "shape": [], "dtype": "float32"}, {"name": "dropout/Const", "shape": [], "dtype": "float32"}, {"name": "Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "wc1", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "Variable", "shape": [32], "dtype": "float32"}, {"name": "sub/x", "shape": [], "dtype": "float32"}, {"name": "wc2", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Variable_1", "shape": [64], "dtype": "float32"}, {"name": "sub_1/x", "shape": [], "dtype": "float32"}, {"name": "wc3", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Variable_2", "shape": [128], "dtype": "float32"}, {"name": "sub_2/x", "shape": [], "dtype": "float32"}, {"name": "Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "wd1", "shape": [7680, 1024], "dtype": "float32"}, {"name": "Variable_3", "shape": [1024], "dtype": "float32"}, {"name": "sub_3/x", "shape": [], "dtype": "float32"}, {"name": "name", "shape": [1024, 40], "dtype": "float32"}, {"name": "Variable_4", "shape": [40], "dtype": "float32"}]}]}